{"pageProps":{"allTags":{"bash":"bash","biohacking":"biohacking","buffer-overflow":"buffer overflow","command-injection":"command injection","development":"Development","dll-injection":"DLL Injection","domains":"domains","ee":"EE","how-to":"how to","ipv6":"IPv6","langsec":"langsec","linux":"linux","makefile":"Makefile","memory":"memory","oaks-internet-safari":"Oaks-Internet-Safari","parsing":"parsing","pcap":"pcap","phishing":"phishing","re":"RE","research":"research","rfid":"RFID","shell":"shell","story":"Story","threat-intel":"Threat-Intel","tutorial":"Tutorial","windows-api":"Windows API","windows-hacking":"Windows Hacking"},"title":"Phishing/Scam campaign research","slug":"phishing-campaign-research","date_published":1540617176000,"date_updated":1541023021000,"tags":["research","phishing"],"excerpt":"An email came in that an end user thought was suspicious. The end user passed it up to one of our team members, who then passed it up to me.","cover":"2018/10/image-3.jpg","author":{"name":"Pips","avatar":"avatars/pips.jpg"},"content":"<p>An email came in that an end user thought was suspicious. The end user passed it up to one of our team members, who then passed it up to me.</p>\n<p>To start off, this email is just dumb. The sender never bothered to copy legitimate Microsoft email formatting, and the wording is just strange. It doesn’t inspire even the most inexperienced users to “<strong><em>rectify password expiration</em></strong>”. Just for fun, let’s look at the url.</p>\n<p><code>hxxp://piba.org.br</code> isn’t a known phishing site, it goes to a Portuguese church website. The site doesn’t matter, what does matter is it looks like the script is being ran through a compromised WordPress site, since it’s going through a <code>/wp-content/</code> uploads folder. It appears that somebody could upload a script to the WordPress site that acts as a pass-through to further obfuscate and prevent the campaign from being detected.</p>\n<p>Once you click the link that passes through WordPress, you end up at a not-so-convincing office 365 login page.</p>\n<p>The email address in the link autofills the email box for your account. Let’s point out some interesting things about this scam site though. </p>\n<ul>\n<li>\n<p>the copyright on the bottom of the page has the <strong>wrong year</strong>.</p>\n</li>\n<li>\n<p>The site doesn't fill the entire page.</p>\n</li>\n<li>\n<p>The buttons and links don't work</p>\n<p>Why don’t they work? Because they’re <strong>images</strong>.</p>\n</li>\n</ul>\n<p>Let’s look at the url and domain. <code>hxxp://fwclub.co.za/</code> is a winemaker’s club. It also doesn’t appear to be running any special framework either that would be exploitable.</p>\n<p>There are quite a few open ports as well on this server, four of them are CPanel. It’s possible that the person running this phishing campaign got access to the site’s CPanel and piggybacked off their normal traffic.</p>\n<p>Back to the original url, <code>hxxp://fwclub.co.za/includes/Office1/Login.php</code>. If we try one directory up, <code>/Office1/</code>, it redirects back to this script. So, lets go up another directory to <code>/includes/</code>.</p>\n<p>Hmm, looks like directory listing is turned on, and… there’s a recent backup of their phishing campaign. Let’s look at this backup.</p>\n<p>Yup, that’s the source code to the credential dumping code. A day later, the domain is shut down in one form or another :(</p>\n<p>Sophos also flagged the site, finally.</p>\n<p>Well, we’ve still got their source code, so let’s take a look. </p>\n<p><code>blocker.php</code> is a very interesting file.</p>\n<p>The code uses a function I’ve never actually seen in PHP before, <code>gethostbyaddr()</code>, which attempts to lookup the incoming IP address to a hostname and possibly an identifier, like as Google or AWS, as well as the host names for a few other malware and phishing scanners.</p>\n<p>It also has a list of banned IP addresses, ranges from Google, Cogent, Digital Ocean, ISC, EQNET, INSC, Amazon, Softlayer, EIG, NTT America, MX Logic, British Telecom, Nianet, Elisa, GigeNET, University Of Minnesota(?), NetVision, NET1 Plus, Unified Webhosting, MULTACOM, China Unicom, Dassault Systèmes, Hurricane Electric, CoreSpace, SITA, Orange S.A, Cyber Wurx, CYBERCON, Zayo Bandwidth, Savvis, QTS, Kasetsart University in Thailand(?), Chungnam National University in South Korea(?), RCC, USAA, Comverse, Omnico Hosting, AT&#x26;T, Marlink, Airstream, The Department of Defense Network Information Center, and DataPipe. Whew, that was a long list. </p>\n<p>The major group of IP ranges are hosting providers that have a large amount of traffic for VPN/Proxy services. It would make sense that the Phisher’s target audience falls outside of hosting companies, it falls to individual users and companies. The second interesting group of IPs are for a few Universities, none in the list make any sense though. Only one of them has a recognized Cybersecurity course. It appears that MXLogic is also on the list, probably to avoid enterprise email filtering detection for companies that use it. I also found it a little interesting that they blocked the DoD as well.</p>\n<p>The last bit of code simply checks if the useragent falls under msnbot, google bot, yahoo bot, etc. They also have a robots.txt that does the same thing.</p>\n<p>Once it has checked the incoming request, the index.php file sets the header (URL) to something along the lines of  <code>login.php?websrc=&#x3C;random numbers>&#x26;dispatched=&#x3C;random numbers>&#x26;id=&#x3C;random numbers>&#x26;email=&#x3C;compromised email></code>. It’s interesting that the phishing author attempted to make the URL look more legitimate and lengthy, as many official emails are.</p>\n<p>Once it goes to the Login.php page, it loads the two images and two text boxes that are supposed to look like, and auto fills the email address, to make it look more “authentic”.</p>\n<p>On the form submit, it hits <code>logon.php</code> (not login). Here’s where something interesting happens. The first thing the script does, is gets the visitors country from geoplugin.net. The second thing it does, is craft a basic email and loads in the submitted username, password, ip, browser, date, and geoip lookup. It then sets the TO: field of this email to <a href=\"mailto:ipconfigura@gmail.com\">ipconfigura@gmail.com</a>, the subject to <code>“Office365 | &#x3C;country> | &#x3C;username>”</code>  and lastly sets the FROM: field to <code>“John De Fisher &#x3C;new@cpanel.com>”</code>.</p>\n<p>After it crafts this email, it then runs a function called <code>check()</code> from inside a PHPMailer directory from the script <code>smtp.php</code>, and passes the submitted username and password. Let’s look at this script then.</p>\n<p>This <code>check()</code> function is incredibly clever. It connects to the office365 SMTP server, authenticates with the server using the submitted credentials, sets the FROM field to the email <code>hbergamini@truehomesusa.com</code>. This is interesting, <code>truehomesusa.com</code> doesn’t seem to be flagged and is a legitimate website, they even run on office 365. I take an educated guess and figure that this domain has not fully set up the correct MX records to protect their domain from email spoofing, allowing this test email to not be noticed by most people and not appear in anybody’s inbox. Clever. It then checks to see if the email sent. If it could send, it means that the submitted credentials successfully authenticated with Microsoft and are correct. </p>\n<p>This is something I don’t see that often. It’s commonplace for campaigns to accept and send off any credentials it gets, but this one is checking the validity of the credentials. It also allows the phishing author to provide a “Password not recognized” message, to skeptical users who input a wrong password the first time to see if it works or not.</p>\n<p>Aaand that's the analysis of this phishing campaign.</p>\n"},"__N_SSG":true}