{"pageProps":{"allTags":{"bash":"bash","biohacking":"biohacking","buffer-overflow":"buffer overflow","command-injection":"command injection","development":"Development","dll-injection":"DLL Injection","domains":"domains","ee":"EE","how-to":"how to","ipv6":"IPv6","langsec":"langsec","linux":"linux","makefile":"Makefile","memory":"memory","oaks-internet-safari":"Oaks-Internet-Safari","parsing":"parsing","pcap":"pcap","phishing":"phishing","re":"RE","research":"research","rfid":"RFID","shell":"shell","story":"Story","threat-intel":"Threat-Intel","tutorial":"Tutorial","windows-api":"Windows API","windows-hacking":"Windows Hacking"},"title":"Quirks in the Windows IPv6 address parsing and printing APIs","slug":"quirks-in-the-windows-ipv6-address-parsing-and-printing-apis","date_published":1607065200000,"date_updated":1607071561000,"tags":["research","WINDOWS API","IPv6"],"excerpt":"Half of the world still lacks Internet access, but there are no IPv4 addresses left to hand out - which means that software libraries for IPv6 deserve scrutiny now.","cover":"2020/12/ipv6_sticker.jpg","author":{"name":"Alex Henrie","avatar":"avatars/alexhenrie.png"},"content":"<p><a href=\"https://en.wikipedia.org/wiki/Global_Internet_usage#Internet_users\">Half of the world still lacks Internet access</a>, but <a href=\"https://ipv4.potaroo.net/\">there are no IPv4 addresses left to hand out</a>. On the other hand, <a href=\"https://www.google.com/intl/en/ipv6/statistics.html\">33% of Google's customer base has a working IPv6 connection now</a> and <a href=\"https://www.zdnet.com/article/apple-tells-app-devs-to-use-ipv6-as-its-1-4-times-faster-than-ipv4/\">Apple is pushing developers to switch just for the performance benefits</a>. It's clear that IPv6 will be increasingly important as time goes on, which means that software libraries for IPv6 deserve scrutiny now.</p>\n<p>Microsoft Windows has accumulated numerous API functions for converting IPv6 addresses from text to binary (parsing) and from binary to text (printing), including:</p>\n<ul>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/iphlpapi/nf-iphlpapi-parsenetworkstring\">iphlpapi.ParseNetworkString</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ws2tcpip/nf-ws2tcpip-inet_pton\">ws2_32.inet_ntop</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ws2tcpip/nf-ws2tcpip-inetntopw\">ws2_32.InetNtopW</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ws2tcpip/nf-ws2tcpip-inet_pton\">ws2_32.inet_pton</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ws2tcpip/nf-ws2tcpip-inetptonw\">ws2_32.InetPtonW</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/winsock2/nf-winsock2-wsaaddresstostringa\">ws2_32.WSAAddressToStringA</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/winsock2/nf-winsock2-wsaaddresstostringw\">ws2_32.WSAAddressToStringW</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/platform-apis/ms775098(v=vs.85)\">urlmon.CreateUri</a> (string normalization only)</li>\n<li>dnsapi.DnsIpv6AddressToString (undocumented)</li>\n<li>dnsapi.DnsIpv6StringToAddress (undocumented)</li>\n</ul>\n<p>However, all of these functions behave identically to, and are surely built upon, the following:</p>\n<ul>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ip2string/nf-ip2string-rtlipv6addresstostringa\">ntdll.RtlIpv6AddressToStringA</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ip2string/nf-ip2string-rtlipv6addresstostringw\">ntdll.RtlIpv6AddressToStringW</a></li>\n<li>ntdll.RtlIpv6AddressToStringExA (not explicitly documented)</li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ip2string/nf-ip2string-rtlipv6addresstostringexw\">ntdll.RtlIpv6AddressToStringExW</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ip2string/nf-ip2string-rtlipv6stringtoaddressa\">ntdll.RtlIpv6StringToAddressA</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ip2string/nf-ip2string-rtlipv6stringtoaddressw\">ntdll.RtlIpv6StringToAddressW</a></li>\n<li>ntdll.RtlIpv6StringToAddressExA (not explicitly documented)</li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/win32/api/ip2string/nf-ip2string-rtlipv6stringtoaddressexw\">ntdll.RtlIpv6StringToAddressExW</a></li>\n</ul>\n<p>The two RtlIpv6AddressToString functions only print plain IPv6 addresses. The <em>Ex</em> suffix in the RtlIpv6AddressToStringEx functions indicates that they were added later, and they can print addresses with or without a network interface number or port.</p>\n<p>Likewise, the RtlIpv6StringToAddress functions are older and can only parse plain IPv6 addresses. They report the <em>terminator</em> via a pointer argument, the terminator being the first unparsable character in the input string. The newer RtlIpv6StringToAddressEx functions can, in addition to parsing unadorned addresses, parse text that includes a network interface number or port. Furthermore, the Ex functions are more strict about what they accept than the originals: They do not report the terminator because they just return an error code if the address does not end at the end of the string.</p>\n<p>This year (2020), I <a href=\"https://source.winehq.org/git/wine.git/blob/bedfb9cae224a369efa4588332a5518dbee57035:/dlls/ntdll/rtl.c#l1091\">implemented all eight of those ntdll functions for Wine</a> from scratch, knowing nothing about how the Windows implementations are coded. I tested millions of string inputs to determine exactly what counts as an IPv6 address in Windows, and in the process found some interesting quirks that could lead to security vulnerabilities in Windows software.</p>\n<h2>RtlIpv6StringToAddress(Ex) might give you the wrong address</h2>\n<p>In a spec-conformant IPv6 address parser, a <code>::</code> <a href=\"https://tools.ietf.org/html/rfc4291#section-2.2\">represents two or more bytes of zeros</a>. In the Windows APIs, this is only true if the double colon is in the middle or at the end of the address: If it comes at the beginning, it counts as at least four bytes of zeros. For example, if the address <code>::1</code> were written as <code>::0:0:0:0:0:0:0:1</code> (perfectly valid according to the spec), RtlIpv6StringToAddress reports that the terminator is the last <code>:</code> instead of the null terminator <code>\\0</code> and it returns <code>STATUS_SUCCESS</code>. RtlIpv6StringToAddressEx is better because it returns the error code <code>STATUS_INVALID_PARAMETER</code> instead. Nevertheless, both functions fill the address buffer with the parsed address, minus two bytes at the end and plus two zero bytes at the beginning. In this example, the binary address that is stored will be <code>::</code> instead of <code>::1</code>. If the calling program does not check for errors thoroughly, this defect could expose sensitive data by causing server software to bind to <code>::</code> (all addresses) instead of <code>::1</code> (localhost only).</p>\n<p>The fact that Windows fails to parse some valid addresses is a compelling reason to avoid using the Windows IPv6 parsing APIs altogether, since differences between how IPv6 implementations output and interpret addresses can lead to software incompatibility. I felt that this was such a glaring problem that I wrote to Microsoft Security about it in January 2020, but because they did not consider it to be a significant security issue, it has yet to be fixed.</p>\n<h2>RtlIpv6AddressToString writes past the null terminator</h2>\n<p>RtlIpv6AddressToString always zeroes out the 46th character of the buffer, even though the longest possible normalized native IPv6 address is only 39 characters:</p>\n<p><code>1111:2222:3333:4444:5555:6666:7777:8888</code></p>\n<p>If the input is an <a href=\"https://en.wikipedia.org/wiki/ISATAP\">ISATAP</a> address (indicated by <code>0</code> or <code>200</code> in the fifth component and <code>5efe</code> in the sixth component), the longest possible normalized address increases to 44 characters in length, which is still one less than 45:</p>\n<p><code>1111:2222:3333:4444:200:5efe:255.255.255.255</code></p>\n<p>Overwriting the 46th character could cause a buffer overflow if the function is given an output buffer of less than 46 characters. The problem was fixed in RtlIpv6AddressToStringEx, which writes the minimum number of characters necessary.</p>\n<h2>RtlIpv6StringToAddress does not limit the length of the last component</h2>\n<p><a href=\"https://tools.ietf.org/html/rfc4291#section-2.2\">An IPv6 address is invalid if any of its components are longer than four digits</a> (even if the extra digits are just leading zeros). And since IPv6 address components are hexadecimal by default, there's no prefix like <code>0x</code> to switch from decimal to hexadecimal. However, RtlIpv6AddressToString waives the length requirement for the last component if it is prefixed with <code>0x</code>, for example:</p>\n<p><code>::0x9999999999999999999999999999999999999999999999999999999999999999999999abcd</code></p>\n<p>No matter how long the last component is, if it starts with <code>0x</code> and contains only hexadecimal digits, the value is taken from the last four digits (<code>::abcd</code> in this example), the terminator is set to the <code>x</code>, and <code>STATUS_SUCCESS</code> is returned. This could result in a buffer overflow if an address that RtlIpv6AddressToString validates is assumed to be 45 characters or less and then copied to a 45-character buffer. The problem is more or less fixed in RtlIpv6StringToAddressEx, which returns <code>STATUS_INVALID_PARAMETER</code> if it encounters a <code>0x</code>, although it still parses and saves the value following the <code>0x</code> in the same way as RtlIpv6StringToAddress.</p>\n<h2>Best practices</h2>\n<p>With all of the above in mind, here's what I recommend:</p>\n<ul>\n<li>For the sake of interoperability, avoid the Windows IPv6 parsing APIs if possible. Use an external library such as <a href=\"https://github.com/jrepp/ipv6-parse\">ipv6-parse</a> instead.</li>\n<li>If you do use the Windows IPv6 parsing or printing APIs, always use the Ex functions instead of the older ones.</li>\n<li>Check the return value of RtlIpv6StringToAddressEx for errors, even if you have already validated the IPv6 address with a spec-conformant parser.</li>\n</ul>\n<p>Happy coding! And if you're not already using <a href=\"https://www.winehq.org/\">Wine</a>, be sure to check out the Wine 6.0 release (I'll be calling it \"Wine Vista\") which is due out at the beginning of next year. Apart from improved IPv6 support, compatibility with popular Windows software has taken an enormous step forward since Wine 5.0 thanks to an overhauled software architecture and tighter integration with MinGW.</p>\n<p>Photo credit: <a href=\"https://www.flickr.com/photos/philwolff/5557354098/in/photolist-9t5TKY-jKi9BZ-reZriP-csBi4j-bozscb-5XWDVu-8qdoiy-9GWxX7-cc8j1J-ost5VM-cj45H5-7FQyVD-5XWDVm-58Zu4e-nQ4nF5-nxHJA4-d8vfpA-nxHH9r-8qdobj-9TExeZ-bvov6x-5NtZnq-7yQMwe-cCjXzo-4qQ54q-48dbjJ-23s1XwA-GxGQpg-brFDWM-bdQpKT-bdPJ1F-brEEDH-2h3Jv9-c2pZVE-bdQgai-nEho6E-9UfTM8-bdQ3N4-6QdWkz-aousCH-kwkHqE-bdQeyz-brEEzR-9QT9bn-9THsMQ-bdQ6Xa-bdQaA4-brFJoP-bdPQki-bdPM64\">Phil Wolff</a></p>\n"},"__N_SSG":true}